#-*- coding:utf8 -*-

#----------------------------------------------
#                Code header
#----------------------------------------------

__author__ = "Muse"
__creation_time__ = "2016.01.13 01:10"
__modification_time__ = "2016.01.21 20:10"
__intro__ = "catcher configuration"


#----------------------------------------------
#               Catcher config
#----------------------------------------------

Chinese_minumum = 60
Chinese_has_rate = 0.21
Compare_rate = 0.28


#----------------------------------------------
#               Catcher limit
#----------------------------------------------

# werid title
Strange_news_title = [
    u"已删除或过期的稿",
]

# ending terms
Ending_terms = [
    u"【新浪财经股吧】",
    u"责任编辑",
    u"版权所有",
    u"下一页",
    u"上一页",
    u"关于我们",
    u"热点资讯",
    u"重点推荐",
    u"【相关",
    u"相关阅读",
    u"相关推荐",
    u"相关图集",
    u"相关报道",
    u"更多精彩内容",
    u"网站简介",
    u"网站地图",
    u"本站所有文章",
    u"凤凰财知道",
    u"每日早间捕捉涨停股",
    u"编译//",
    u"本文来源",
]

Start_terms = [
    u"中金在线微信",
    u"分享到：",
]
