#-*- coding:utf8 -*-

#----------------------------------------------
#                Code header
#----------------------------------------------

__author__ = "Muse"
__creation_time__ = "2016.01.13 01:10"
__modification_time__ = "2016.04.20 14:10"
__intro__ = "catcher configuration"


#----------------------------------------------
#               Catcher config
#----------------------------------------------

Chinese_minumum = 58
Chinese_has_rate = 0.20
Compare_rate = 0.25


#----------------------------------------------
#               Catcher limit
#----------------------------------------------

# werid title
Strange_news_title = [
    u"已删除或过期的稿",
]

# ending terms
Ending_terms = [
    u"相关链接",
    u"【新浪财经股吧】",
    u"版权所有",
    u"下一页",
    u"上一页",
    u"关于我们",
    u"热点资讯",
    u"重点推荐",
    u"【相关",
    u"相关阅读",
    u"相关推荐",
    u"相关图集",
    u"更多精彩内容",
    u"网站简介",
    u"网站地图",
    u"本站所有文章",
    u"凤凰财知道",
    u"每日早间捕捉涨停股",
    u"本文来源",
    u".F.X.1.6.8",
    u"新浪声明：",
    u"编辑：",
    u"关键词：",
    u"责任编辑",
    u"校对：",
    u"建议及投诉热线",
    u"助你寻找概念牛股",
    u"图片源于网络",
    u"特别提醒：",
    u"版权合作及网站合作电话",
    u"互联网药品信息服务资格证书",
    u"商报简介",
    u"本文系观察者网独家稿件",
]

Start_terms = [
    u"中金在线微信",
    u"分享到：",
    u"&nbsp中财网",
    u"日讯",
    u"视频轮播",
    u"扫描二维码",
    u"黄金网官方微信",
    u"摘要：",
    u"原标题：",
    u"中金在线客服",
]
